I have a similar issue, each time I run our CI/CD pipeline changes are reported for the v2 apps

```  # rancher2_app_v2.applications["rancher-cis-benchmark"] must be replaced
-/+ resource "rancher2_app_v2" "applications" {
      ~ annotations                 = {
          - "objectset.rio.cattle.io/applied"         = "H4sIAAAAAAAA/7RYW2/buBL+KwT7KsmXOI4joA+nKXBQHJxukRT7sNsCHZEjiWuKFEjK2Wzg/74YSY7t+lI3tV+CWBx+c/u+IaVnXmEACQF4+swNVMhT7sCIEl0slI8zNKKswM151C77GgTZ0Jqt0UGwLvZPPmDFIy4cQlDWfFYV+gBVzVPTaB1xDRlqTz5s9heK4DEkTtlEQAgaE2UHJfiSp/xmfDvLAaZymstxPr6VNzCR49tsNpvMrm+zLBtlubyeTPgy4mCMDa2/o8hK8pSXqKsY6ppHB+3so0EXF4s5T/lgMYrY/5SRbx9QOAw/3NaXzpcJeUocagSPyWKU7K1mshidBHms3MuIt4b3mKNDI9Dz9M9nDrX6HZ1X1vCUt27mylAJXjJ5VaxNW8ahvBnCZJrHMM1u4glMruPb4WQW32RjiTdjvJmOp8QDa4KzWqPjaXANRjzTVsx/o3Dfo8bQRpeD9rj8uoy4r1GcQEBlcktmuXI+vMda2yekqMbD8SgejePR1efRbToaplfTPziR7hQriV44VXch8Q/GB9CaCVvVGgPyiPsAofE85XKFFXGHINtQ37D7Llh29+GBvVsFy+5KcOGL+WI+l8g2u8fQQKbRM9cYo0zR7ntJknkUjVPhiXkBxjNrGLB5k6EzGNAzoRsf0DEwkhVoCBK7WBUYgcxhbV3wLJQQmADDMmTSPhptQaJMKKA3rM+xVQ49+fbt2xdDVGCqz35vA1gyYHHcShzX5GSxYXvY2aMSSQWVgtr2E6Nm8cLgUTJMrobDnUZdpK4kFnx6tE6SlvhqE/8acSVat2UItU8HgzYpvxIMiRa8x+AH2hbWDygygu+SSvyi4NEeZUJdbz6hVPnOXBMQQNtiYz5AE2zc9+pQEWPh5NsKgihJjzsQAl1QuWqF0e/fayeVrzU8rebbFsn3bjjhkNjZY0ldWpnm773LtbMLJdHHxcJ1qOvFpO9c29ZBW9RdgH7CxT8g3e7GRsUkLmvQhIMbl8uIL0A32HYL8lwZ4kz6TEeURhfa5x09ZT/1IhKDU8J/sqSN2XA2jLjHBbZ0S/kjOCIxyafQNgPdEyFobP/rkv7Y5UMzqi3ue8yh0eEeC+WDIxwCIB6K0CLQePAq2Hatz2awWo94gKLj4WiWTNu8VAVF51H5VScPAm22exONWE1DvlfTgwBzEGNlFFND1yDDZJyMWxBrbNbYp8MAvUH8YrkBMppSKMuIGyvxATWKLp8lTXRvG9ceovQzWE2JdBqkO8yxLh9p0QcSmLYCqL7bbVs9Pda7w2vbIX9/7hsMj9bNlSmS+cwTlTdvAh+71U9WK/G0vhDIzk0MWttH+nvCnW8ZHb1xuIUS+B8hbGM2bh7bQJ0RbBldxOV5Pd1Zk6vi/1DvFnBjJtXO5kqjf403l4FIoAmldeqflov7mnnXObu3GrfTBVkpc3bUhcLHnwPNMMApyC/1cLR0JhfvlJE0SA97ynqLXy/UcV/9eY1u1xPUtd8C7W6tFR4SzWvYtHVs7kuB5vK77173evBRcn1uwOn5AHFOgMPzARZzPC+gm2Pc1zEuwUk0KC+DXqOrlPdqsUdBv44/vWj000tFP75s8cfnq/6n7rjYUV/cnyPnhZ2eG5Z62UO+lPoXhsdR/HWtL+VhI4PXTqvTMzinhw1CfpfKRZ2cn/002c9M0WLdAL78uvGlYXTKB84SdfUSwdVy/XHomfumqsD1bwQ2o8smyv9232ha8+Fy+W8AAAD//zVpjmxvFQAA"
          - "objectset.rio.cattle.io/id"              = "helm-app"
          - "objectset.rio.cattle.io/owner-gvk"       = "/v1, Kind=Secret"
          - "objectset.rio.cattle.io/owner-name"      = "sh.helm.release.v1.rancher-cis-benchmark.v1"
          - "objectset.rio.cattle.io/owner-namespace" = "cis-operator-system"
        } -> (known after apply)
        chart_name                  = "rancher-cis-benchmark"
        chart_version               = "1.0.300"
        cleanup_on_fail             = true
      ~ cluster_id                  = "local" -> (known after apply) # forces replacement
      ~ cluster_name                = "local" -> (known after apply)
        disable_hooks               = false
        disable_open_api_validation = false
        force_upgrade               = false
      ~ id                          = "local.cis-operator-system/rancher-cis-benchmark" -> (known after apply)
      ~ labels                      = {
          - "objectset.rio.cattle.io/hash" = "7298faa6d6fd2f29d7a4d29b884859bbb1bfd544"
        } -> (known after apply)
        name                        = "rancher-cis-benchmark"
        namespace                   = "cis-operator-system"
      ~ project_id                  = "local:p-hq47c" -> (known after apply)
        repo_name                   = "rancher-charts"
      + system_default_registry     = (known after apply)
      ~ values                      = <<~EOT
            affinity: {}
            global:
              cattle:
                clusterId: local
                clusterName: local
          -     systemDefaultRegistry: ""
          -   systemDefaultRegistry: ""
        EOT
        wait                        = true
    }
  # rancher2_app_v2.applications["rancher-logging"] must be replaced
-/+ resource "rancher2_app_v2" "applications" {
      ~ annotations                 = {
          - "objectset.rio.cattle.io/applied"         = "H4sIAAAAAAAA/+xbUXPbOJL+KyjkHsY+kpLsOHF0NQ+JncylJk5cdrJXe7YrgoCmhDUIcAFQjhLrv18BBClKlGQql92qrVrPw8QguvtDd6O70YB/4AwsYcQSPPyBJckAD7Emkk5Bx0JNJlxOcOQ/mJxQ95USawVUH2MzNxYyHGGqgViu5GeegbEky/FQFkJEWJAxCOP4q/HfgFoDNtFcJSWjhKvelJgpHuKXLwcnp8dAT14c0/Gr/mn/lJ30j+iL58DY8xfjdJCmbPD8hOBFhImUynp5Ozlzhod4CiKLSZ7jaOs89SBBx5PZPR7i3mwQoT+5ZL9fA9VgnyQLajPTxElKNAggBpLZIFnTZDIbdGK2W9WLCPupV5CCBknB4OHND0xy/hfQhiuJh9gLuufSLb9exZ44C688IDB4BS9fxYSlJH7ef5XGpwxO49PBKZwcpS9fwcmps76SVishQOOh1QVEeCwUvf/kgJ6DAOtxpUQYWNwtImxyoDtdjstUuQkp18aeQy7UHByeo/7RIB4cxYPjz4NXw0F/ePzyf7Fzsi6zGBiqeV6Cwe+lsUQIRFWWC7CAI2wssYXBQ8wqXhHWQJgHeSufoQ8lQKRy0MQqjc6mRNtbeStv1j/d/Ta1NjfDXm/C7bQYJ1RlvTGR3wmnQhWsV9m1IjhAF0SSCTBEQVpNBP8ODIVZHqWSIC1KRQHSMkQkC/+Ox9wi7pYjKSAlERWFsaATB+zZM2TFfzE9dL+MRqMxMdNb+R/IOQHSkCtEGEMNYLGxZCwAVfDvizFoCRZMTN1qTdKY7Fa1yq3IGbFQj/Gg5baAlgI8vAD5vfMnVlBnKzf0ecoN8uLRWClrrCa5QQTVav/082ovjZ053SrpeP5Zr7jktqKEhKuDSsGoME62nQK6+W8Q2VK432JmeoByQu/JBFDmbVub5FKDhr8X3HALxo3FaCkVDZLT/0QP3E7RG7AEvb58bxBIpzRW68ertZJeu+FnVWvcjZca85zcr2HPI7ft0Cibx2FgtNE5Kkaxj0poOX1PYz5DZ1fn5lZ+MYBGPk/AWWGsyq7AqEJT+N0HhlGJ0+kRzY6RVYjMFGfI6rlfpkIlreeGUq0yv6YR1cyMUKoEA11uCv8JslwQp0xi/Tzj1mB5BknpT+C2VObml/Y36PBwfQ8fHjqPcNQN41S2r7XKICWFsIgqmfJJoX1eSpATcbMydvfbs5XfD5AB7+FIcGONZ5YTTTKwoN2vxCJKJBpDzRsYYoV2GIN1SmHBK75Ivt0viupjj7mIDKX2Gk7Q2Agb/SGQLSlqGze1qSFTM6d2IVa0VsUvg4gxinJigS11WDpqaQ3hCRr+Wi3vrKm8Sm6qhFAPfsHOEU1Dl7WyXThrKFal/vO6yzZA2ClwXRt2RkQBxqN4RBt/Livmmz9voULofJmROhCeBzzNCQ5SvP8P+imqLoQlpBHPyAQSlxEMt0rPR9tU0FzsmZKWcAkaeXK0JH+CcDSZUu2qqF2RfrQCzZJJB0xboVky6UY4Ok5Ok6OtopqQ8kKISyU43VdbjhDlnrITpPfpR2UvNRiQti2qhORi/qcZaM0ZdFTUI6oIygyjUkTyvBPhaLeIElJaCLEnrAYkR90dV0dIdb3eHdOaljz1r4T0QCydfqw4dzLdI6rnuzzrOaBU6are/VSXu1fnPwNJjwlNQgHT2ZfOymzvaJEBPeMUEKFUFbKM0Vq5aL+BcOROINvFNCDlJt8D1iO6KIx12bgwVe5aW5qTnKD3qf9HFAoWg26Lfv/ohSMz6OrN6zOkQ+VjkK8CXVrnZaGxUl3cXCqGroEWmts58qGBV0WpWa9Ke0xR06NKUsit6ZXhoJcrFpvAIQ5jB1UxmQSFhfprp8JyzZVjciaIMc5dOnl65Tgt6icIRz8Wu/iXkEiacsltl2i55PxRMUCvA+U+hJ0g1YbdK7dcfuldQObSXEXv/QKMNT3BM243+HlnSFYJKEumzqCClj4vKTsTjm7unoYkFYNrEEB9Vu7I+RxSLgE9TDmdenxlkXepmEFEAzJ0CqwQwJCrvpuQOvnSsqPUXUsBUoPWR81WYZk7jHtDyhWr9r5L9fBtQ65uQWpGjEDVjOT10SZBNxdKA+IyVXsFlDqY0JJ776Cjun7ux+nqFutCvjYflbxSyt7iYQivYfyLAe0GB/1+3w2m5g+titwNHfX7/UVV95k9lblWZP2ztVqunLjTzaXmMy5gAm8NJeWRz63Oh22vBiDskxRzp553XEDZKqwUVStg09n7CS3UadgdupNlci0ZZkq66pzLSRIy9EU5sj2r1gwvtcrATqEwyywRmAS2SSM1PbrD12thQUti+QzEPEIE/fX1xQeUcgHlWdnkQHnKQ2AoT23eTGsH63CmzrWaceYy+dSxWDs6+8Nggt4pjeAbyXIBezZJ4rQ6OM5Jtl8DzNULx4AODz/z/PBwiP6qCg+6MLDScbhpCLj7rfHLQbtN9K7RNny3bBvOOKniVXWizjXMuCqqfhtTYNDhoVT28LBe7ijQjJYZy6rQQNgmqtGYRKt9qgzlpc6qBbbaetVO27u917MaoJcRJ7ZX9i9bc6q+80Ew+r9W2zSuzbdsn/6DOyVx3ZV+qmPybzX+EjX+u/HUufFkhdnzqIke0duSAH3+cO0bmYXk1BsdjcE+AMhm/7JJ6LLhLs41pHBrU97GdTs+eQHXIacxZDyp7xlEoQqmZXGCrDCIgm5ge0T+xuSBC4HUDPSD5hYQKazKiOW07LI7Ep66lQKagISqc72OesztvxhuMyUa2J/Q8Wj4iK49AbqHeW1x6Y8YvwXDxbUqDlYIbxy2AALYXYtz2biqaLt75mOVu5t3fN3W0sknl5Bk11ZR06g1+co9RKOhtUroL1+IWd6brk5ch9S5Q/sY6gsHhO7ToX1Eo0HyInn+RNNjHVKHfvYuSDv72bW43tLio6chdWgab4bUoWncsVUctsg+YXfdvVkHmkC4h3uz7p601BLbz5O8lmaDZDBITmIici4hHoyextTpamQ7pieuRrZciQQIo93QOt1DbILW6R5iT6eaKVFkcKHY+ydNuYS0SvSkQR/RyN8Vb+0J7IS0y5KdIa3b8xGNxoWZj9W3LZh2QtplwQ6QNttxT8OVxfAVCEUY6J3WW/GldaJd1nNbr58cbb9fexrSFuvtB6lhvUc0+hvPMs7mRsleSZyRPNaewagLpC3W6wqpZb09DRf+fzmjLt8nhFIw5sJVQy3KJaQctOHGgqQQ/AqVhCjzdVSLcHRzBYT9j6vvPkkK613jnZDqLntStckTY5UmExjthmT496254xGNjgZ/8KcujrZACvI33o7shlQSUke4AdItdv/tisO3Ei8i7I+QeNjxReesfirob6f7g9bruDMlBFBryhc1XLgjplATE548TflkKuarB96yRXipHsCV0uM5euMzDzpzqQetd3QSHOF7mD8ozQwe3uAluGVXEUe4aoziuwhz6qFVrYHQDwirc6mOGANlf0fVXZ7EzByf9vtIkud/WVUDbj0spcQSoSaNZ5qu3I9DzdtWbUw1+z0jlk5xtIE4HFz8G8VAuXEe4yYXZF49Lf1Qq6Y9tdPb3BaVMniIBZfFt42fQ2fUxJOZdhODJpudF66S0MxLhXrozQZjsGSwkVtoiMZbvbFNUvC4PnAvAeDFIsJlT8QZhzDGnaWICAq6LoOC/3bv/xcq0urpaYRhy/jkHjaO3x+XflAF168gJ1z6d7ReuwxHbSK9iVmE68rdfRRq8lXADJwT+ceuEc4g+zou0hT0V3/ph4f45OKNX7S+h6MN+BYRru5A8fBH6130IjzLXmv514AYN47d5YxWr3ZriF8bt4b+fTGkKVAH6aO6Dhdt5QbGQ+xOyrFWApLVm47wKjgXRLrJ3nJ4iJ0ovIhWeL79BrSwT7MES1mL1V2E15+G4CHGEZ4INSYibGQrvFVKu4WO1hVMuLHaSfR6dqHFTcqVC6an/dO+i0D+UsJ7VUu95RZ4f+kX4VdZv3dfRNjOc4fkrJ7lZPiKwQup0zwe4maC9q+Oq4JiuWOalXy83kvEEbZkUkeySs5lIUTZuzHVg3w/Xnl1yidfdagj3NBGuct6Jl6vZ2qxZRnm5K64+UZ+4Xy7PObWXPyZfIXJVwbjYvKzrOKSumbItjJq6raaW69t7XTnzdjIUs6rVq6/Nm/Vtn+2Xg+F4cb1uGO1ugUasXsR4fYlcel6rQcX5bAeE7qCrtz3uck3Y9aQC07JmSpcIB64AVNH2cUyPa/I3id2rOSkCNfuPMRv/14Q0djrYcl3q0mgHcM2bfpqnzKfTKjnG8ZK3dSj28PD7m+d3cHfyLY1u1hR7e4/6PC8X5dPoZZ/2PEzf7fjovCKIP+ciRR2qjT/XrZV70+92zUhhIB2pbwht8j/lbwr2IRlXP5DOM84POzHuCp42tzfcMmWFuiimg32/cWGJXluVrRxXj/2/sWSNleLbYV9WBHyq6Q3niRQpUEZf0O8Qb/V3vz/ib9rnKUG3f5Sbgoiq/EeL5Z/dfQDmyLLiA61nBq7KALsj/qGAw/7i8X/BQAA//+5CbhetDcAAA"
          - "objectset.rio.cattle.io/id"              = "helm-app"
          - "objectset.rio.cattle.io/owner-gvk"       = "/v1, Kind=Secret"
          - "objectset.rio.cattle.io/owner-name"      = "sh.helm.release.v1.rancher-logging.v1"
          - "objectset.rio.cattle.io/owner-namespace" = "cattle-logging-system"
        } -> (known after apply)
        chart_name                  = "rancher-logging"
        chart_version               = "3.8.201"
        cleanup_on_fail             = true
      ~ cluster_id                  = "local" -> (known after apply) # forces replacement
      ~ cluster_name                = "local" -> (known after apply)
        disable_hooks               = false
        disable_open_api_validation = false
        force_upgrade               = false
      ~ id                          = "local.cattle-logging-system/rancher-logging" -> (known after apply)
      ~ labels                      = {
          - "objectset.rio.cattle.io/hash" = "771583ec563cb90808d502c64edd46bf1ffd145a"
        } -> (known after apply)
        name                        = "rancher-logging"
        namespace                   = "cattle-logging-system"
      ~ project_id                  = "local:p-hq47c" -> (known after apply)
        repo_name                   = "rancher-charts"
      + system_default_registry     = (known after apply)
      ~ values                      = <<~EOT
            disablePvc: true
            global:
              cattle:
                clusterId: local
                clusterName: local
          -     systemDefaultRegistry: ""
          -   systemDefaultRegistry: ""
            monitoring:
              serviceMonitor:
                enabled: true
            replicaCount: 1
        EOT
        wait                        = true
    }
    ```